package com.mobile.rxjava2andretrofit2.first_page.bean;

import java.util.List;

public class FirstPageResponse {

    /**
     * err_no : 0
     * err_tips :
     * offset : 10
     * api_param : {"enter_from":"","origin_from":""}
     * ans_list : [{"ansid":"6857399014657605888","forward_count":3,"comment_count":59,"digg_count":4153,"brow_count":3917812,"bury_count":80,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6857399014657605888&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A0%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226857399014657605888%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%224472293773%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6857399014657605888&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A0%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226857399014657605888%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%224472293773%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1596612767,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6857399014657605888","user":{"uname":"园娘娘有点野","avatar_url":"https://p1-dy.bytexservice.com/img/user-avatar/073069f529d89c28ae2fa0b77be09bd2~300x300.image","user_id":"4472293773","is_verify":0,"create_time":1433338089,"user_intro":"","is_following":0,"user_auth_info":"","schema":"sslocal://profile?refer=wenda&uid=4472293773","total_digg":13149,"total_answer":192,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"http://p6-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05","share_url":"https://m.zjurl.cn/answer/6857399014657605888/?app=news_article&app_id=0","title":"女生突然弯了是什么体验？(园娘娘有点野的回答)- 悟空问答"},"content_abstract":{"text":"我读高中的时候，身边有两个玩的很好的女同学。高一的时侯都还喜欢男生啊。突然高二的时候因为同时喜欢一个女生翻脸了。她们两同时喜欢的那个女生个子170以上，皮肤白白的，很瘦，长得比大多数男生还帅气。当时在我们附近几所高中之间的弯弯群还挺有名气，听说好多女生都喜欢她。后来我这两个女同学的其中一个和他谈了一段时间恋爱。大概小半年。他们在一起也有亲密动作......和她们聊起女生弯了是什么感觉，大概就是看到她有像见到喜欢的人一样的心动感，想每天都她在一起，手牵手和做任何亲密的动作也毫无违和感。谈恋爱和正常异性之间没有区别。最后，这两个女生里的其中一个上大学后就恢复正常了，现在都是两个孩子的妈了。而另一个女生已无法回头，一直弯下去了。现在仍然和女人生活在一起。我们这群同学都知道，但是也没人笑话她，都尊重她个人的性取向。同学聚会呀、朋友圈呀这些她也从来不避嫌，还会带上她现在的\u201c男朋友\u201d，也经常发两个人的亲密自拍照。因为有过接触同性恋的经历，所以后来也很自然的接受了同性恋人成为我的朋友。其中有一对事业爱情都发展的很好，两个人白手起家通过10年的努力有了自己的公司，大概几千万资产，依然相亲相爱感情很好。让我看到了爱情的样子。最后总结一下：女同性恋，又称拉拉、蕾丝边、Lesbian、Les、 Girlslove，是指只对同性产生爱情和性欲的女性。很多女同性恋都是在青春期后才开始发现原来自己喜欢同性，就像我的同学那样。她们更注重女权的平等，相互支持与依偎取暖。也需要得到我们更多的认可与平常心态。女生突然弯了，可能，是世界给你敞开了另一扇情感的大门。一样心动，一样恋爱，一样幸福。","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6881631043347906823","forward_count":0,"comment_count":5,"digg_count":2075,"brow_count":1650660,"bury_count":36,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6881631043347906823&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A1%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226881631043347906823%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%221644510300875655%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6881631043347906823&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A1%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226881631043347906823%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%221644510300875655%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1602255007,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6881631043347906823","user":{"uname":"仇伟","avatar_url":"https://sf3-ttcdn-tos.pstatp.com/img/user-avatar/4fcc3d659eab019da1128df9860031c4~300x300.image","user_id":"1644510300875655","is_verify":1,"create_time":1590052520,"user_intro":"优质生活领域创作者","is_following":0,"user_auth_info":"{\"auth_type\":\"0\",\"auth_info\":\"优质生活领域创作者\",\"other_auth\":{\"interest\":\"优质生活领域创作者\"}}","schema":"sslocal://profile?refer=wenda&uid=1644510300875655","total_digg":72927,"total_answer":514,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"https://sf3-ttcdn-tos.pstatp.com/img/user-avatar/4fcc3d659eab019da1128df9860031c4~300x300.image","share_url":"https://m.zjurl.cn/answer/6881631043347906823/?app=news_article&app_id=0","title":"仇伟回答了女生突然弯了是什么体验？(2075赞)- 悟空问答"},"content_abstract":{"text":"女生突然弯了是什么体验？这个我有切身的感受，那种感觉有一丝丝甜蜜和新鲜，但是更多的却是羞愧难当，不能去释放自己的本性，也不能和任何人倾诉，只能努力的去压抑，因为我接受的传统教育不允许我肆意妄为。那是大一的时候，我本来有一个非常恩爱的男友，他长的高大帅气，家庭条件也不错，关键是对我体贴，不管走到哪我们都是令人羡慕的一对。但是一次偶然的邂逅改变了这一切，那是在午后的图书馆，我遇到了一位女孩，她长的非常漂亮，苗条的身材，大大的眼睛，雪白的皮肤，看着让人心旷神怡，我瞬间如触动一般兴奋不已，那种感觉是我和男朋友在一起从未有过的。难道这就是传说中的\u201c弯了\u201d？那次以后我无法自拔的天天呆在图书馆，希望能再次遇到她，哪怕只是看她一眼也心满意足，我终于体验到了什么叫\u201c牵肠挂肚\u201d，那种相思让我日渐消瘦。男朋友发觉我的异常后关切的问我怎么了，我这才发觉这段时间我冷落他了，也明白不能再这样下去了，这种事情是不会有结果的，强迫自己踩住了刹车。女士弯了的体验其实并不美好，在道德枷锁面前这种事情注定不会有结果！","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6881756795401699599","forward_count":0,"comment_count":19,"digg_count":1670,"brow_count":1658773,"bury_count":20,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6881756795401699599&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A2%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226881756795401699599%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%224059017110368392%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6881756795401699599&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A2%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226881756795401699599%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%224059017110368392%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1602284558,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6881756795401699599","user":{"uname":"奔跑吧阳光","avatar_url":"https://p1-dy.bytexservice.com/img/tos-cn-i-0813/de6a474bef604232b3eb40b9785d8c55~c5_1080x1080.jpeg?from=4010531038","user_id":"4059017110368392","is_verify":1,"create_time":1568215405,"user_intro":"vlog领域创作者","is_following":0,"user_auth_info":"{\"auth_info\":\"\",\"auth_type\":\"3\"}","schema":"sslocal://profile?refer=wenda&uid=4059017110368392","total_digg":28475,"total_answer":249,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"https://p1-dy.bytexservice.com/img/tos-cn-i-0813/de6a474bef604232b3eb40b9785d8c55~c5_1080x1080.jpeg?from=4010531038","share_url":"https://m.zjurl.cn/answer/6881756795401699599/?app=news_article&app_id=0","title":"奔跑吧阳光回答了女生突然弯了是什么体验？(1670赞)- 悟空问答"},"content_abstract":{"text":"女生突然弯了，这个词我也是第一次见。\u201c女同性恋\u201d在日常生活中其实不常见，如果一个女孩子突然发现自己是女同，还是挺难以启齿的。我刚出来打工的时候，遇到一个女同事，她长得并不漂亮，但是人特别的好，主要是我们玩的很好。那时候我们住的是宿舍那里面洗澡🛀都是单间，有一次，她就要求我和她一起洗澡，被我拒绝了，我感觉虽然关系好，但是一起洗澡还是觉得有点尴尬。那天，就感觉她很失落，以前一起吃饭的，突然不找我了，我还有点不习惯。我们不在一个寝室，然后我就去主动找她，她又跟孩子似的突然不生气了。我也搞不懂为什么？我们一起吃饭，一起逛街，一起买衣服，但我觉得很奇怪，她每次选的衣服都比较中性，但是给我挑的衣服却不会。我们每天形影不离，她对我的一切都很关心，尤其是谈恋爱这件事，好像所有的男生都配不上我，我开玩笑地说，那我找个美女好了，她就说:要找就找我吧。我当时以为是玩笑，只是笑了笑。后来，就认识了我老公，他喜欢下班的时候，在门口等我，给我买糖，带我吃夜宵，我朋友看见了，很生气，就告诉我他不怀好意，让我拒绝他，然后一有时间就带我去比较远的地方玩。我跟她说，我觉得我老公还挺好的，人很老实，也很关心我。我和老公开始恋爱了，他就是个跟屁虫，我去哪里他都想去，就是感觉他和我朋友看起来怪怪的，就像敌人一样。慢慢的我朋友不找我了，后来还辞职了，但是都没有跟我说，直接拿了工资就走了。我心里很纳闷，为什么走都不吱声？后来，我们结婚了，老公才告诉我，我朋友找过他谈话，她说我们说恋人关系，说我是女同，让我老公不要拆散我们，不要做第三者。老公说，其实店里人都说我们是同性恋，但是他不信，但我朋友的话至少让他知道我朋友是同性恋。当他这样说的时候，我才恍然大悟，也觉得不可思议，真是后知后觉呀！难怪她从来没有谈过男朋友，工作这些年一直只和我玩，可能是我的性格让她误以为我也是女同吧！不过，我还是挺吃惊的，这是我第一次接触女同，但是她从来没有跟我挑明，可能还是觉得难以启齿吧，毕竟在我们国家，能接受这种事情的人还是很少的。你们遇到过女同性恋吗？","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6883417412856398080","forward_count":1,"comment_count":52,"digg_count":869,"brow_count":1166311,"bury_count":14,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6883417412856398080&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A3%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226883417412856398080%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%224349317291706107%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6883417412856398080&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A3%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226883417412856398080%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%224349317291706107%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1602670708,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6883417412856398080","user":{"uname":"大明359","avatar_url":"https://p1-dy.bytexservice.com/img/user-avatar/4a8ce2038812a5302928623be3883563~300x300.image","user_id":"4349317291706107","is_verify":1,"create_time":1579239334,"user_intro":"优质情感领域创作者","is_following":0,"user_auth_info":"{\"auth_type\":\"0\",\"auth_info\":\"优质情感领域创作者\",\"other_auth\":{\"interest\":\"优质情感领域创作者\"}}","schema":"sslocal://profile?refer=wenda&uid=4349317291706107","total_digg":56706,"total_answer":713,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"https://p1-dy.bytexservice.com/img/user-avatar/4a8ce2038812a5302928623be3883563~300x300.image","share_url":"https://m.zjurl.cn/answer/6883417412856398080/?app=news_article&app_id=0","title":"大明359回答了女生突然弯了是什么体验？(869赞)- 悟空问答"},"content_abstract":{"text":"世间最遥远的距离，莫过于我还在你面前，你却突然弯了。我们是理工学院，文艺青年不多，文学社就我跟雪雪几乎是必然选择了。雪雪是隔壁系的，很清纯的妹子，言谈举止更是高雅大方。我们是文艺青年，讲究红袖添香，观松听涛，赌书消得泼茶香\u2014\u2014那些第一天就牵手，没几天就开房，的行为是我们所不齿的。所以虽然彼此都有意思，整一年最亲密的，也只是四目对视传情而已。第二年暑假回来，却发现她有些逃避我，不再敢看我的目光，她在躲避着什么？就算她有男朋友了，也不用这样呀。百思不得其解，却发现她跟校花突然好的不得了，那会我是看了女孩子都会脸红的人，校花这种等级的，更是不敢上前去。后来有次文学社弄墙报，不小心背碰了雪雪一下，她却条件反射一般连退几步。胆小内向的人特别敏感，我马上就意识到\u2014\u2014她居然弯了？对于男人来说大概没有比这更窝心的事，就算她出轨还有机会追回来，可这个\u2014\u2014不，我不甘心，我要把她追回来！我准备了一个多月，十月十号那天约她到文学社谈点事。我做了一个手势，然后双眼平和坦然的看着她，她不可置信的瞪大了眼睛，我一字一句的说:\u201c山有木兮木有枝，心悦君兮君不知？\u201d。这下她嘴巴都张得老大，我再轻轻划了一下她的手心，她终于不再怀疑，一拍额头笑了起来说:\u201c难怪今天找我，我早该想到的\u201d。从那以后我们毫不避忌啥都可以说，完全是亲密无间、情同姐妹。后来我强吻了她一次，她却剧烈的呕吐起来，边哭边跑的走了。看着她远去的背影\u2014\u2014原来世间上最遥远的距离，是我还在你面前，你却已经弯了。结语:女人突然喜欢女人，大多数并不是真的弯了，一般都是以下的原因:1:遇到了一个真正对自己好的女生，更多的只是被她的情绪感染了而已；2:她完全符合自己心目中，自己最美时候的形象，所以在潜意识中认可了她；3:她很像那个你曾经很依赖的女性长辈，潜意识中她取代了长辈，你变得很依赖她。如果对男生并不反感，那就不是真的弯了，只是一种错觉而已。只有会条件反射一般排斥男生，才是真的弯了。山有木兮木有枝，心悦君兮君不知？","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6857042236359475467","forward_count":44,"comment_count":204,"digg_count":770,"brow_count":1562667,"bury_count":12,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6857042236359475467&answer_type=1&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A4%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226857042236359475467%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%222590092849842227%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6857042236359475467&answer_type=1&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A4%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226857042236359475467%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%222590092849842227%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1596529826,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6857042236359475467","user":{"uname":"山林狂野谈人生","avatar_url":"https://sf3-ttcdn-tos.pstatp.com/img/user-avatar/875f2ddfe7d9a0d06b73ca486ce65c0f~300x300.image","user_id":"2590092849842227","is_verify":0,"create_time":1563315084,"user_intro":"","is_following":0,"user_auth_info":"","schema":"sslocal://profile?refer=wenda&uid=2590092849842227","total_digg":32227,"total_answer":521,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"http://p6-tt-ipv6.byteimg.com/list/300x196/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c.webp","share_url":"https://m.zjurl.cn/answer/6857042236359475467/?app=news_article&app_id=0","title":"女生突然弯了是什么体验？(山林狂野谈人生的回答)- 悟空问答"},"content_abstract":{"text":"是一种窒息浪漫永远热恋的体验，而且不一般的缘分和澎湃心动。爱，无论是哪一种，都需要点暧昧和臆想才有味道，说的更严重点就是意想是最精妙的催情剂，是能让人上瘾和抓狂的东西，所以一旦心动了，就会让你浮想联翩，臆想不断。爱的形式一般分三种，异性恋、同性恋、双性恋。同性恋女性多些，因为很多属于模糊地带，只要没距离感了，就很容易实现激情游戏。我在网聊过程中遇见几位这样的朋友，所以对他们的一些事情了解一些。他们都很有才华和能力，也都正常结婚，而且都有孩子，只是快速完成生育任务后就把对象凉到一边了，自己不碰还不允许对方出轨，挺有意思的。这种情况一般主要由三种原因造成的。第一是先天的生理原因，外表和实际生理不一样，这类人变性手术很方便，以后性别维持也简单。第二是幼时心理受过异性性感知严重伤害造成的。第三种是幼时当异性孩子养大的缘故，心理暗示一直是异性。当然还有别的因素，就不多展开了。由于社会普遍不接纳这种现象，甚至歧视他们，所以这类群体压力山大，只能隐蔽状态生活，而且大多自己也瞧不起自己，自杀率比正常人群高很多，而且女性弯的比男性多，女性双性恋的也更多。他们的生活方式我们肯定接受不了，女同还好点，毕竟有点前戏的感觉，男同就是要一个男人代替女人，常人会感觉有点不爽。还有一个怪现象，同性恋大家一般不认同，变性手术后就基本接受了，大家想过是何原因吗？至于体验，因为爱，自然富于臆想，而且大部分属于恋爱偷情状态，体验应该是更激情浪漫通透的感觉，毕竟偷的感觉更刺激。我要呼吁社会尽量理解他们吧，他们也是很无奈的感觉。","thumb_image_list":[{"height":192,"width":192,"uri":"tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c","url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c?from=wenda","type":1,"url_list":[{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c?from=wenda"},{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c?from=wenda"},{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c?from=wenda"}]},{"height":192,"width":192,"uri":"tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7","url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7?from=wenda","type":1,"url_list":[{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7?from=wenda"},{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7?from=wenda"},{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7?from=wenda"}]},{"height":192,"width":192,"uri":"tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d","url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d?from=wenda","type":5,"url_list":[{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d?from=wenda"},{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d?from=wenda"},{"url":"http://p1-tt-ipv6.byteimg.com/list/s192/tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d?from=wenda"}]}],"large_image_list":[{"height":1600,"width":1066,"uri":"tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c","url":"http://p6-tt-ipv6.byteimg.com/large/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c?from=wenda","type":1,"url_list":[{"url":"http://p6-tt-ipv6.byteimg.com/large/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c?from=wenda"},{"url":"http://p6-tt-ipv6.byteimg.com/large/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c?from=wenda"},{"url":"http://p6-tt-ipv6.byteimg.com/large/tos-cn-i-0022/27606f25e7824f10867500e2eb3f959c?from=wenda"}]},{"height":640,"width":419,"uri":"tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7","url":"http://p9-tt-ipv6.byteimg.com/large/tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7?from=wenda","type":1,"url_list":[{"url":"http://p9-tt-ipv6.byteimg.com/large/tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7?from=wenda"},{"url":"http://p9-tt-ipv6.byteimg.com/large/tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7?from=wenda"},{"url":"http://p9-tt-ipv6.byteimg.com/large/tos-cn-i-0022/24000edbe8044c6cba8d952ab1ab3ba7?from=wenda"}]},{"height":565,"width":565,"uri":"tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d","url":"http://p6-tt-ipv6.byteimg.com/large/tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d?from=wenda","type":5,"url_list":[{"url":"http://p6-tt-ipv6.byteimg.com/large/tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d?from=wenda"},{"url":"http://p6-tt-ipv6.byteimg.com/large/tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d?from=wenda"},{"url":"http://p6-tt-ipv6.byteimg.com/large/tos-cn-i-0022/82612ac18f3f4785858b2a870e5eb58d?from=wenda"}]}],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6894760666511851791","forward_count":1,"comment_count":4,"digg_count":597,"brow_count":664429,"bury_count":2,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6894760666511851791&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A5%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226894760666511851791%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%2258890196395%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6894760666511851791&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A5%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226894760666511851791%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%2258890196395%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1605311880,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6894760666511851791","user":{"uname":"鲁的太太","avatar_url":"https://sf3-ttcdn-tos.pstatp.com/img/pgc-image/52444e7b47c44b93bbfb7a52e27ac281~120x256.image","user_id":"58890196395","is_verify":1,"create_time":1491486521,"user_intro":"辽宁数字广播电视设备集团有限公司电子工程师 育儿领域创作者","is_following":0,"user_auth_info":"{\"auth_info\":\"\",\"auth_type\":\"3\"}","schema":"sslocal://profile?refer=wenda&uid=58890196395","total_digg":16737,"total_answer":146,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"https://sf3-ttcdn-tos.pstatp.com/img/pgc-image/52444e7b47c44b93bbfb7a52e27ac281~120x256.image","share_url":"https://m.zjurl.cn/answer/6894760666511851791/?app=news_article&app_id=0","title":"鲁的太太回答了女生突然弯了是什么体验？(597赞)- 悟空问答"},"content_abstract":{"text":"看到了这个问题，忽然就想起了青葱的大学时光。大学我们寝室住了4个人，我，闺蜜小静，长相和打扮都偏中性的莹莹和微胖但特别女人的菲菲。莹莹家是本地的，周末都回家，周日晚上回来。一个周日，莹莹晚上没回来，我们打电话才知道，她得了急性阑尾炎住院了。我们周三下午没课，就集体去医院看她，看她虚弱的样子，我和小静一直开玩笑，活跃气氛。这时，菲菲突然哭着跑出去了，我们都有些莫名其妙。回到学校菲菲一直都郁郁寡欢，也不和我俩一起走了，然后周四的时候她又单独去看了一次莹莹。又过了一两周吧，莹莹回到学校，忽然就开始排斥菲菲，干什么都要拉着我和小静。当时我有男朋友，经常要出去约会啥滴，莹莹就总和小静一起吃饭，一起上自习什么的。有一天，我约会回来，菲菲居然在寝室楼下等我，说想和我谈一谈。开始她含含糊糊的，最后终于问我，小静会不会喜欢莹莹？我说不可能，俩女的有什么喜欢不喜欢的，志趣相投就是朋友呗。当时我就发现菲菲的表情有些怪，然后她说，那没事了，咱们上楼吧。第二天莹莹特意早起跟我和小静一起去吃早饭，她之前基本是不吃早饭的。吃饭的时候，莹莹问我昨天菲菲和我说了什么？我和盘托出，还觉得挺搞笑的。然后莹莹沉默了，她说一会我不去上课了，你们帮我请个假，然后确定菲菲去上课了就给我发个信息。我说你要干什么？她说要确定一件事，然后告诉我们。下午我们只有一节课，但是外面下着小雨，就都在寝室里待着。我们仨都趴在床看书，或者玩手机，只有菲菲一个人坐在书桌旁，翻着一本日记。忽然，菲菲说，莹莹，你还记得某年某月你说过的话吗？莹莹说，我一天说这么多话，哪能每一句都记得。然后菲菲一下就把那页日记撕掉了，然后撕的粉碎，扔进垃圾桶。当时我和小静都惊着了，停下手中的事，看着菲菲。菲菲背对着我们，然后又说，莹莹，你还记得某年某月你送过我什么礼物吗？莹莹说，不记得了。菲菲又撕了一页日记，撕的粉碎，扔到垃圾桶里。这时我收到了小静发给我的信息，她说这气氛不对啊，咱俩去图书馆吧。我给她回了\u201cOK\u201d，就是开始蹑手蹑脚的收拾东西，准备撤离寝室。菲菲还在问莹莹，记不记得某年某月给她唱过一首歌，能不能再给她唱一遍？莹莹说不行，闲的没事，唱什么歌？然后喊住我和小静，要和我们一起走。我们说去食堂，她收拾好了下来找我们。后来莹莹来了，告诉我们，第二次菲菲自己去医院看她的时候给她写了一封信，说什么\u201c你不在，世界都没有了颜色\u201d，\u201c看你虚弱痛苦的样子，我恨不得以身代之\u201d云云，信的最后还写了\u201c我爱你\u201d三个字。当时我和小静都惊呆了，本不排斥同性恋，但是没想到就发生在身边。原来，早上，莹莹没去上课，在寝室里偷看了菲菲的日记。她说知道这是不对的，但就是想确定她到底是不是对自己有\u201c非分之想\u201d。而且看完之后莹莹也没有隐藏，所以菲菲一回来就发现了，才有了刚才撕日记的一幕。我们开玩笑说，谁让你长的这么雌雄莫辨，这是男女通吃啊。莹莹说，我长的再像个爷儿们，内心里其实也是个小公主来的。后来莹莹申请了走读，菲菲也搬到别的寝室去住。就这样，一转眼毕业已经很多年了，菲菲已经嫁人，是两个孩子的妈妈了。莹莹也去了深圳打拼事业。但我们寝室的四个人，只有我和小静保持着密切的联系，莹莹偶尔有只言片语捎来，菲菲的消息确是从别的同学那了解到的。","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6878993731777855758","forward_count":1,"comment_count":11,"digg_count":435,"brow_count":1311865,"bury_count":5,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6878993731777855758&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A6%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226878993731777855758%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%223825913865705102%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6878993731777855758&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A6%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226878993731777855758%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%223825913865705102%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1601640892,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6878993731777855758","user":{"uname":"温度情感","avatar_url":"https://sf3-ttcdn-tos.pstatp.com/img/pgc-image/da8780ca8ace4f15a2de5eeeccbb8f62~120x256.image","user_id":"3825913865705102","is_verify":1,"create_time":1583337555,"user_intro":"优质情感领域创作者","is_following":0,"user_auth_info":"{\"auth_type\":\"0\",\"auth_info\":\"优质情感领域创作者\",\"other_auth\":{\"interest\":\"优质情感领域创作者\"}}","schema":"sslocal://profile?refer=wenda&uid=3825913865705102","total_digg":14713,"total_answer":245,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"https://sf3-ttcdn-tos.pstatp.com/img/pgc-image/da8780ca8ace4f15a2de5eeeccbb8f62~120x256.image","share_url":"https://m.zjurl.cn/answer/6878993731777855758/?app=news_article&app_id=0","title":"温度情感回答了女生突然弯了是什么体验？(435赞)- 悟空问答"},"content_abstract":{"text":"我和男朋友分手之后，发现自己的性取向发生了变化，还向我的闺蜜表白了，那种感觉比和男人在一起好千倍百倍。我和男朋友是在一个社交舞会上认识的，当时我被他的英俊的外表迷住了，对他一见钟情，我就主动的过去跟他聊天，他的谈吐举止非常的文雅，在舞会结束的时候，我跟他要了联系方式，说有空一起出来玩。第二天，我就给他打电话，约他一起出来吃个饭，他答应了。我们吃完饭，就去看电影，当天晚上我们都没有回家，而是酒店去开了一个房间，我们在一起了，他顺理成章的成了我的男朋友。开始的时候，他确实对我是千依百顺，我说什么就是什么，可是随着时间越来越长，他开始对我不耐烦了，动不动就跟我吵架，后来他忍受不了我，就跟我分手了。他分手之后我很伤心，这个时候我的闺蜜就来安慰我，开导我，我的闺蜜就陪着我到处吃吃喝喝，我们还去了旅游。我的闺蜜非常的理解我，很多事情我根本不需要说出口，她就已经知道我在想什么了，就好像心有灵犀那样。后来我发现自己喜欢上了她，我找了一个机会向她表白了，本来我以为她会拒绝我的，毕竟这种事情不光彩。出乎意料的是，她居然答应了，说她也喜欢我，在认识我的那个时候起就已经喜欢我了，只是不好意思跟我开口而已。就这样我们都弯了，和她在一起非常的舒服，也很温馨，那种感觉比和男人在一起要好千倍万倍，我们的关系也许得不到大家的支持，但是只要我们过的开心就足够了。她从来都不会掩饰她对我的爱，她能够给我足够的安全感，这是其他男人给不了我的感觉，只有女生才更了解女生的需求是什么。我总结了一下，女生弯了，也许在大家看来，这是不可思议的事情，甚至是无法接受的一件事情，但是，每个人都有自己选择的权利，只要不妨碍到他人，就可以了，自己过的快乐，开心比什么都重要。女生突然弯了的感觉，就像是发现了新大陆一样，原来和女生在一起的感觉会比和男生在一起的感觉更加的舒服。","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6884960336010264847","forward_count":0,"comment_count":24,"digg_count":408,"brow_count":1119157,"bury_count":0,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6884960336010264847&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A7%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226884960336010264847%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%221807222728300355%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6884960336010264847&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A7%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226884960336010264847%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%221807222728300355%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1603029947,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6884960336010264847","user":{"uname":"霍泱泱","avatar_url":"https://p1-dy.bytexservice.com/img/user-avatar/8e0608b55aaf3cd7f1f54fd15af27c90~300x300.image","user_id":"1807222728300355","is_verify":0,"create_time":1572160325,"user_intro":"","is_following":0,"user_auth_info":"","schema":"sslocal://profile?refer=wenda&uid=1807222728300355","total_digg":69344,"total_answer":157,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"http://p1-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05","share_url":"https://m.zjurl.cn/answer/6884960336010264847/?app=news_article&app_id=0","title":"女生突然弯了是什么体验？(霍泱泱的回答)- 悟空问答"},"content_abstract":{"text":"我是女同性恋，很负责任告诉你，你不是突然弯了，而是你骨子里从生下来就是弯的，这是改变不了的。我是一个98年的小姐姐，身高170CM，皮肤白皙，虽不是什么绝世美人，但追求者也不少，在我未发现自己是同性恋之前，我找不到我对男人为何提不起兴趣，不管是帅的，还是有钱的？通通没感觉！我感觉他们在我身边晃来晃去，特别的烦人。我还依稀记得第一个给我写情书的男同学，按理说，我们这个年纪手机已普遍，谁还写情书啊！那天清晨，我如往常一样来到学校，当看到书桌里的情书时，我愤怒了，我对这种事说不出喜欢也说不上讨厌，但发生在我身上时，我会很暴躁，和其他女同学反应大不相同。我拿起书桌里的情书问是谁的？然后，当着对方的面直接撕碎。自此，高中时代再没人敢追求我！大一下学期，我被一个富二代追求，他第一次和我表白，我当场拒绝，我说我不喜欢他，他却说喜欢我，周围同学嚷嚷着让我们在一起，我却无动于衷。晚上，在寝室室友问我怎么回事？问我喜欢什么样的？我说我也不知道，这时，突然其中一个室友问我是不是同性恋？我听得出她是在开玩笑，但我把她的话放在了心上，开始上网搜索同性恋的事，那时，我才开始怀疑我可能是个同性恋。我的怀疑是有根据的，我会莫名其妙的对女同学多一点关注，平时也留意女同学的一举一动，我虽不清楚这到底是怎回事？但，这对于一个女生来说真得很不正常！第一次，我真正敢直面这个问题时，我遇见了她，她的出现打破了我的平静，我不再像平常那样对感情这种东西闭口不提，我开始想见到她，我开始想和她说话，我开始特别期待她能看我一眼\u2026\u2026这种悸动，让我意识到我可能恋爱了！后来，我表白了，那时我知道什么是喜欢，什么是爱？我想和她天天在一起，同看日出日落，共享人世繁华！","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6881406478847754499","forward_count":0,"comment_count":11,"digg_count":324,"brow_count":1469086,"bury_count":3,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6881406478847754499&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A8%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226881406478847754499%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%225763389715%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6881406478847754499&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A8%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226881406478847754499%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%225763389715%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1602202873,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6881406478847754499","user":{"uname":"四嫂63647869","avatar_url":"https://sf3-ttcdn-tos.pstatp.com/img/mosaic-legacy/14f000663d7e25ff44a~120x256.image","user_id":"5763389715","is_verify":1,"create_time":1448067936,"user_intro":"情感领域创作者","is_following":0,"user_auth_info":"{\"auth_info\":\"\",\"auth_type\":\"3\"}","schema":"sslocal://profile?refer=wenda&uid=5763389715","total_digg":29936,"total_answer":1115,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"https://sf3-ttcdn-tos.pstatp.com/img/mosaic-legacy/14f000663d7e25ff44a~120x256.image","share_url":"https://m.zjurl.cn/answer/6881406478847754499/?app=news_article&app_id=0","title":"四嫂63647869回答了女生突然弯了是什么体验？(324赞)- 悟空问答"},"content_abstract":{"text":"女生突然弯了，那种体验应该是只能意会不能言传吧，作为正常人的我们是不会明白的，也不会理解的。上高中时，班上转来一名女同学，1米75的个头，五官长的特精致，梳着假小子头，惹的附近的小混混天天来学校，趴在班级的窗户往里看，放学路上经常被堵被劫。那时候什么都不懂，都说她不正经，招蜂引蝶，后来却发现她总是爱和几个女生在一起，整天在宿舍里拉着窗帘，也不去教室里上课，都以为她是为了躲避那些小混混呢。再后来她就不念书了，回家了。因为长的漂亮的，追求者很多，其中不乏局长家的公子，可都没能修成正果。再后来和一个家庭条件不错的会计结了婚，生了一个女孩，经常看见她骑着一个大摩托车在街上兜风。听说没几年就离了，现在和一个女的出双入对的住在一起，两个人共同经营着一家苗圃，种些园林用的树木，花苗之类的，现在想起来她那时候就应该是一个同性恋。","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""},{"ansid":"6895704779616862471","forward_count":0,"comment_count":1,"digg_count":280,"brow_count":583030,"bury_count":0,"is_digg":false,"is_show_bury":true,"is_buryed":false,"title":"","schema":"sslocal://wenda_detail?ansid=6895704779616862471&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A9%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226895704779616862471%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%22101065552958%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0","comment_schema":"sslocal://wenda_detail?ansid=6895704779616862471&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A9%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226895704779616862471%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%22101065552958%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0","create_time":1605531692,"ans_url":"https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6895704779616862471","user":{"uname":"情感小沐柯","avatar_url":"https://sf6-ttcdn-tos.pstatp.com/img/mosaic-legacy/2d5c50001faffb0abc0a1~120x256.image","user_id":"101065552958","is_verify":1,"create_time":1545879181,"user_intro":"优质情感领域创作者","is_following":0,"user_auth_info":"{\"auth_type\":\"0\",\"auth_info\":\"优质情感领域创作者\",\"other_auth\":{\"interest\":\"优质情感领域创作者\"}}","schema":"sslocal://profile?refer=wenda&uid=101065552958","total_digg":49499,"total_answer":1024,"desc_icon_url":""},"share_data":{"content":"看热点讨论，问明星专家，上悟空头条","image_url":"https://sf6-ttcdn-tos.pstatp.com/img/mosaic-legacy/2d5c50001faffb0abc0a1~120x256.image","share_url":"https://m.zjurl.cn/answer/6895704779616862471/?app=news_article&app_id=0","title":"情感小沐柯回答了女生突然弯了是什么体验？(280赞)- 悟空问答"},"content_abstract":{"text":"对于女生\u201c弯了\u201d，目前为止，我应该只见过一次，可能是个人比较直吧！所以身边的朋友也基本上没有这种取向的，下面，就来给大家谈谈那个女生吧！这段事还是在当初读高三的时候，因为个人是属于艺考生，所以高三上半个学期基本上没有什么课，都是在专注艺术这一块，但是，俗话说林子大了，什么鸟都有，恰巧，也就见识到了一个弯了的女孩子（当然，虽然我本身比较直，但我并不排斥弯了的，只不过个人不太能够接罢了）。最早认识这个女孩子的时候，其实并没有发现她的性取向有问题，只不过相对来讲，这个女孩子打扮的比较中性，剪了短头发，平时的穿着也都是偏男孩子，所以我第一眼看到她的时候，我以为她是男生，但又感觉不像，也不好意思去问人家这个问题，所以这件事也就暂且搁置下来了。不过渐渐的，熟悉这东西也是来的快，特别是学艺术这一块，一个教室不过十来个人，一天下来转一圈基本上也就熟悉了。后来也知道了她是女生，更是知道了她的性取向弯了，当时，基本上一个教室所有人都知道了，不过，正所谓自己没露出尴尬，那么尴尬的就会是别人，她自己看的很淡，所以我们自然也就没有人会多说什么，再加上彼此都是同学，那个年龄段虽然都懂了，但至少还都保持着一份稚嫩，也没有人会去特意关注她。对于这个话题，很少有人会跟她主动聊什么，但闲来无事之下，总是少不了聊这聊那，所以有时候听到她和她旁边的同学谈到这一话题时，小小一个的教室基本上也都听得到。在她看来，她说她能够正视这一问题，哪怕没有人能够理解，但是她也觉得并没有什么，再者说，弯不弯是她自己的事，在没有妨碍到其他人的前提下，也算不得什么事。另外在我们外人看来，她和正常的女生也并没有什么区别，也是很正常的交朋友，很正常的说话，只不过她在学校外面有一个女朋友，有时候我们在校外吃饭也能偶尔看到她俩比较亲密的举动。所以综合来讲，我认为要讲她的体验，最大的应该是没有人能够理解，其次，偶尔将会遭到旁人的白眼，不过其余时间，如果和这个女孩子玩得熟了，会发现其实也并没有什么，挺开朗的一个女孩子。感谢关注［情感小沐柯］，给你有温度、有启迪的情感疏导。图片来自网络，侵删","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]},"user_repin":false,"log_pb":"","is_origin_pair_ans":false,"show_text":"","show_count":0,"display_count":0,"read_count":0,"category_name":"","enter_from":"","answer_detail":null,"enable_prefetch":false,"enable_prefetch_cdn":false,"answer_detail_cdn":""}]
     * has_more : true
     * related_question_banner_type : 0
     * related_question_reason_url : sslocal://detail?groupid=6765352884386136589
     * can_answer : true
     * candidate_invite_user : []
     * module_list : [{"day_icon_url":"http://p26-tt.byteimg.com/origin/1bf50001abbc1c7f8dba","night_icon_url":"http://p9-tt-ipv6.byteimg.com/origin/1bf40001abebc0717135","text":"更多问答","schema":"sslocal://feed?api_param=%7B%22enter_from%22%3A%22%22%2C%22origin_from%22%3A%22%22%2C%22source%22%3A%22question_brow%22%7D&category=question_and_answer&concern_id=6260258266329123329&name=%E5%9B%9E%E7%AD%94&type=4","icon_type":2}]
     * module_count : 1
     * question_header_content_fold_max_count : 1
     * show_format : {"font_size":"18","show_module":1,"answer_full_context_color":0}
     * question : {"qid":"6855150375201390856","post_answer_url":"sslocal://wenda_post?extra_publisher_default_tab_index=0&qTitle=%E5%A5%B3%E7%94%9F%E7%AA%81%E7%84%B6%E5%BC%AF%E4%BA%86%E6%98%AF%E4%BB%80%E4%B9%88%E4%BD%93%E9%AA%8C%EF%BC%9F&qid=6855150375201390856","is_follow":false,"nice_ans_count":171,"normal_ans_count":65,"follow_count":350,"create_time":1596089247,"can_edit":false,"show_edit":false,"can_public_edit":false,"show_public_edit":false,"can_delete":false,"show_delete":false,"show_tag_module":false,"title":"女生突然弯了是什么体验？","concern_tag_list":[],"user":{"uname":"匿名用户","avatar_url":"http://p6-tt-ipv6.byteimg.com/origin/2e0dc000fea68ec4d698e","user_id":"0","is_verify":0,"user_intro":"","is_following":0,"user_auth_info":"","desc_icon_url":""},"share_data":{"content":"本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。","image_url":"http://p9-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05","share_url":"https://m.zjurl.cn/question/6855150375201390856/?app=news_article&app_id=0","title":"女生突然弯了是什么体验？(236个回答) - 悟空问答"},"content":{"text":"本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"rich_text":"本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。","content_rich_span":"{\"links\":[]}"},"fold_reason":{"open_url":"sslocal://detail?groupid=6293724675596402946","title":"为什么折叠?"},"is_anonymous":1,"share_info":{"share_type":{"pyq":0,"qq":0,"qzone":0,"wx":0},"token_type":1,"share_url":"https://m.zjurl.cn/question/6855150375201390856/?app=news_article&app_id=0","title":"女生突然弯了是什么体验？(236个回答) - 悟空问答"},"count_statistics":[{"count_name":"收藏量","count_num":"350","count_type":1}],"hidden_answer":"","qid_type":"unsub_qid","tips":{"tips_type":0,"tips_text":"","tips_schema":"","tips_button_text":""},"dispute_info":null,"is_public_edit":false,"show_modify_record":false,"modify_record_schema":"","public_edit_reasons":null,"need_user_name":false,"show_count":0,"show_text":"","can_not_edit_reason":""}
     * has_profit : false
     * repost_params : {"repost_type":218,"fw_id":6855150375201390856,"fw_id_type":1026,"fw_user_id":3708573337,"opt_id":6855150375201390856,"opt_id_type":1026,"schema":"","title":"女生突然弯了是什么体验？","cover_url":"http://p9-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05"}
     */

    private int err_no;
    private String err_tips;
    private int offset;
    private String api_param;
    private boolean has_more;
    private int related_question_banner_type;
    private String related_question_reason_url;
    private boolean can_answer;
    private int module_count;
    private int question_header_content_fold_max_count;
    private ShowFormatBean show_format;
    private QuestionBean question;
    private boolean has_profit;
    private RepostParamsBean repost_params;
    private List<AnsListBean> ans_list;
    private List<?> candidate_invite_user;
    private List<ModuleListBean> module_list;

    public int getErr_no() {
        return err_no;
    }

    public void setErr_no(int err_no) {
        this.err_no = err_no;
    }

    public String getErr_tips() {
        return err_tips;
    }

    public void setErr_tips(String err_tips) {
        this.err_tips = err_tips;
    }

    public int getOffset() {
        return offset;
    }

    public void setOffset(int offset) {
        this.offset = offset;
    }

    public String getApi_param() {
        return api_param;
    }

    public void setApi_param(String api_param) {
        this.api_param = api_param;
    }

    public boolean isHas_more() {
        return has_more;
    }

    public void setHas_more(boolean has_more) {
        this.has_more = has_more;
    }

    public int getRelated_question_banner_type() {
        return related_question_banner_type;
    }

    public void setRelated_question_banner_type(int related_question_banner_type) {
        this.related_question_banner_type = related_question_banner_type;
    }

    public String getRelated_question_reason_url() {
        return related_question_reason_url;
    }

    public void setRelated_question_reason_url(String related_question_reason_url) {
        this.related_question_reason_url = related_question_reason_url;
    }

    public boolean isCan_answer() {
        return can_answer;
    }

    public void setCan_answer(boolean can_answer) {
        this.can_answer = can_answer;
    }

    public int getModule_count() {
        return module_count;
    }

    public void setModule_count(int module_count) {
        this.module_count = module_count;
    }

    public int getQuestion_header_content_fold_max_count() {
        return question_header_content_fold_max_count;
    }

    public void setQuestion_header_content_fold_max_count(int question_header_content_fold_max_count) {
        this.question_header_content_fold_max_count = question_header_content_fold_max_count;
    }

    public ShowFormatBean getShow_format() {
        return show_format;
    }

    public void setShow_format(ShowFormatBean show_format) {
        this.show_format = show_format;
    }

    public QuestionBean getQuestion() {
        return question;
    }

    public void setQuestion(QuestionBean question) {
        this.question = question;
    }

    public boolean isHas_profit() {
        return has_profit;
    }

    public void setHas_profit(boolean has_profit) {
        this.has_profit = has_profit;
    }

    public RepostParamsBean getRepost_params() {
        return repost_params;
    }

    public void setRepost_params(RepostParamsBean repost_params) {
        this.repost_params = repost_params;
    }

    public List<AnsListBean> getAns_list() {
        return ans_list;
    }

    public void setAns_list(List<AnsListBean> ans_list) {
        this.ans_list = ans_list;
    }

    public List<?> getCandidate_invite_user() {
        return candidate_invite_user;
    }

    public void setCandidate_invite_user(List<?> candidate_invite_user) {
        this.candidate_invite_user = candidate_invite_user;
    }

    public List<ModuleListBean> getModule_list() {
        return module_list;
    }

    public void setModule_list(List<ModuleListBean> module_list) {
        this.module_list = module_list;
    }

    public static class ShowFormatBean {
        /**
         * font_size : 18
         * show_module : 1
         * answer_full_context_color : 0
         */

        private String font_size;
        private int show_module;
        private int answer_full_context_color;

        public String getFont_size() {
            return font_size;
        }

        public void setFont_size(String font_size) {
            this.font_size = font_size;
        }

        public int getShow_module() {
            return show_module;
        }

        public void setShow_module(int show_module) {
            this.show_module = show_module;
        }

        public int getAnswer_full_context_color() {
            return answer_full_context_color;
        }

        public void setAnswer_full_context_color(int answer_full_context_color) {
            this.answer_full_context_color = answer_full_context_color;
        }
    }

    public static class QuestionBean {
        /**
         * qid : 6855150375201390856
         * post_answer_url : sslocal://wenda_post?extra_publisher_default_tab_index=0&qTitle=%E5%A5%B3%E7%94%9F%E7%AA%81%E7%84%B6%E5%BC%AF%E4%BA%86%E6%98%AF%E4%BB%80%E4%B9%88%E4%BD%93%E9%AA%8C%EF%BC%9F&qid=6855150375201390856
         * is_follow : false
         * nice_ans_count : 171
         * normal_ans_count : 65
         * follow_count : 350
         * create_time : 1596089247
         * can_edit : false
         * show_edit : false
         * can_public_edit : false
         * show_public_edit : false
         * can_delete : false
         * show_delete : false
         * show_tag_module : false
         * title : 女生突然弯了是什么体验？
         * concern_tag_list : []
         * user : {"uname":"匿名用户","avatar_url":"http://p6-tt-ipv6.byteimg.com/origin/2e0dc000fea68ec4d698e","user_id":"0","is_verify":0,"user_intro":"","is_following":0,"user_auth_info":"","desc_icon_url":""}
         * share_data : {"content":"本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。","image_url":"http://p9-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05","share_url":"https://m.zjurl.cn/question/6855150375201390856/?app=news_article&app_id=0","title":"女生突然弯了是什么体验？(236个回答) - 悟空问答"}
         * content : {"text":"本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"rich_text":"本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。","content_rich_span":"{\"links\":[]}"}
         * fold_reason : {"open_url":"sslocal://detail?groupid=6293724675596402946","title":"为什么折叠?"}
         * is_anonymous : 1
         * share_info : {"share_type":{"pyq":0,"qq":0,"qzone":0,"wx":0},"token_type":1,"share_url":"https://m.zjurl.cn/question/6855150375201390856/?app=news_article&app_id=0","title":"女生突然弯了是什么体验？(236个回答) - 悟空问答"}
         * count_statistics : [{"count_name":"收藏量","count_num":"350","count_type":1}]
         * hidden_answer :
         * qid_type : unsub_qid
         * tips : {"tips_type":0,"tips_text":"","tips_schema":"","tips_button_text":""}
         * dispute_info : null
         * is_public_edit : false
         * show_modify_record : false
         * modify_record_schema :
         * public_edit_reasons : null
         * need_user_name : false
         * show_count : 0
         * show_text :
         * can_not_edit_reason :
         */

        private String qid;
        private String post_answer_url;
        private boolean is_follow;
        private int nice_ans_count;
        private int normal_ans_count;
        private int follow_count;
        private int create_time;
        private boolean can_edit;
        private boolean show_edit;
        private boolean can_public_edit;
        private boolean show_public_edit;
        private boolean can_delete;
        private boolean show_delete;
        private boolean show_tag_module;
        private String title;
        private UserBean user;
        private ShareDataBean share_data;
        private ContentBean content;
        private FoldReasonBean fold_reason;
        private int is_anonymous;
        private ShareInfoBean share_info;
        private String hidden_answer;
        private String qid_type;
        private TipsBean tips;
        private Object dispute_info;
        private boolean is_public_edit;
        private boolean show_modify_record;
        private String modify_record_schema;
        private Object public_edit_reasons;
        private boolean need_user_name;
        private int show_count;
        private String show_text;
        private String can_not_edit_reason;
        private List<?> concern_tag_list;
        private List<CountStatisticsBean> count_statistics;

        public String getQid() {
            return qid;
        }

        public void setQid(String qid) {
            this.qid = qid;
        }

        public String getPost_answer_url() {
            return post_answer_url;
        }

        public void setPost_answer_url(String post_answer_url) {
            this.post_answer_url = post_answer_url;
        }

        public boolean isIs_follow() {
            return is_follow;
        }

        public void setIs_follow(boolean is_follow) {
            this.is_follow = is_follow;
        }

        public int getNice_ans_count() {
            return nice_ans_count;
        }

        public void setNice_ans_count(int nice_ans_count) {
            this.nice_ans_count = nice_ans_count;
        }

        public int getNormal_ans_count() {
            return normal_ans_count;
        }

        public void setNormal_ans_count(int normal_ans_count) {
            this.normal_ans_count = normal_ans_count;
        }

        public int getFollow_count() {
            return follow_count;
        }

        public void setFollow_count(int follow_count) {
            this.follow_count = follow_count;
        }

        public int getCreate_time() {
            return create_time;
        }

        public void setCreate_time(int create_time) {
            this.create_time = create_time;
        }

        public boolean isCan_edit() {
            return can_edit;
        }

        public void setCan_edit(boolean can_edit) {
            this.can_edit = can_edit;
        }

        public boolean isShow_edit() {
            return show_edit;
        }

        public void setShow_edit(boolean show_edit) {
            this.show_edit = show_edit;
        }

        public boolean isCan_public_edit() {
            return can_public_edit;
        }

        public void setCan_public_edit(boolean can_public_edit) {
            this.can_public_edit = can_public_edit;
        }

        public boolean isShow_public_edit() {
            return show_public_edit;
        }

        public void setShow_public_edit(boolean show_public_edit) {
            this.show_public_edit = show_public_edit;
        }

        public boolean isCan_delete() {
            return can_delete;
        }

        public void setCan_delete(boolean can_delete) {
            this.can_delete = can_delete;
        }

        public boolean isShow_delete() {
            return show_delete;
        }

        public void setShow_delete(boolean show_delete) {
            this.show_delete = show_delete;
        }

        public boolean isShow_tag_module() {
            return show_tag_module;
        }

        public void setShow_tag_module(boolean show_tag_module) {
            this.show_tag_module = show_tag_module;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public UserBean getUser() {
            return user;
        }

        public void setUser(UserBean user) {
            this.user = user;
        }

        public ShareDataBean getShare_data() {
            return share_data;
        }

        public void setShare_data(ShareDataBean share_data) {
            this.share_data = share_data;
        }

        public ContentBean getContent() {
            return content;
        }

        public void setContent(ContentBean content) {
            this.content = content;
        }

        public FoldReasonBean getFold_reason() {
            return fold_reason;
        }

        public void setFold_reason(FoldReasonBean fold_reason) {
            this.fold_reason = fold_reason;
        }

        public int getIs_anonymous() {
            return is_anonymous;
        }

        public void setIs_anonymous(int is_anonymous) {
            this.is_anonymous = is_anonymous;
        }

        public ShareInfoBean getShare_info() {
            return share_info;
        }

        public void setShare_info(ShareInfoBean share_info) {
            this.share_info = share_info;
        }

        public String getHidden_answer() {
            return hidden_answer;
        }

        public void setHidden_answer(String hidden_answer) {
            this.hidden_answer = hidden_answer;
        }

        public String getQid_type() {
            return qid_type;
        }

        public void setQid_type(String qid_type) {
            this.qid_type = qid_type;
        }

        public TipsBean getTips() {
            return tips;
        }

        public void setTips(TipsBean tips) {
            this.tips = tips;
        }

        public Object getDispute_info() {
            return dispute_info;
        }

        public void setDispute_info(Object dispute_info) {
            this.dispute_info = dispute_info;
        }

        public boolean isIs_public_edit() {
            return is_public_edit;
        }

        public void setIs_public_edit(boolean is_public_edit) {
            this.is_public_edit = is_public_edit;
        }

        public boolean isShow_modify_record() {
            return show_modify_record;
        }

        public void setShow_modify_record(boolean show_modify_record) {
            this.show_modify_record = show_modify_record;
        }

        public String getModify_record_schema() {
            return modify_record_schema;
        }

        public void setModify_record_schema(String modify_record_schema) {
            this.modify_record_schema = modify_record_schema;
        }

        public Object getPublic_edit_reasons() {
            return public_edit_reasons;
        }

        public void setPublic_edit_reasons(Object public_edit_reasons) {
            this.public_edit_reasons = public_edit_reasons;
        }

        public boolean isNeed_user_name() {
            return need_user_name;
        }

        public void setNeed_user_name(boolean need_user_name) {
            this.need_user_name = need_user_name;
        }

        public int getShow_count() {
            return show_count;
        }

        public void setShow_count(int show_count) {
            this.show_count = show_count;
        }

        public String getShow_text() {
            return show_text;
        }

        public void setShow_text(String show_text) {
            this.show_text = show_text;
        }

        public String getCan_not_edit_reason() {
            return can_not_edit_reason;
        }

        public void setCan_not_edit_reason(String can_not_edit_reason) {
            this.can_not_edit_reason = can_not_edit_reason;
        }

        public List<?> getConcern_tag_list() {
            return concern_tag_list;
        }

        public void setConcern_tag_list(List<?> concern_tag_list) {
            this.concern_tag_list = concern_tag_list;
        }

        public List<CountStatisticsBean> getCount_statistics() {
            return count_statistics;
        }

        public void setCount_statistics(List<CountStatisticsBean> count_statistics) {
            this.count_statistics = count_statistics;
        }

        public static class UserBean {
            /**
             * uname : 匿名用户
             * avatar_url : http://p6-tt-ipv6.byteimg.com/origin/2e0dc000fea68ec4d698e
             * user_id : 0
             * is_verify : 0
             * user_intro :
             * is_following : 0
             * user_auth_info :
             * desc_icon_url :
             */

            private String uname;
            private String avatar_url;
            private String user_id;
            private int is_verify;
            private String user_intro;
            private int is_following;
            private String user_auth_info;
            private String desc_icon_url;

            public String getUname() {
                return uname;
            }

            public void setUname(String uname) {
                this.uname = uname;
            }

            public String getAvatar_url() {
                return avatar_url;
            }

            public void setAvatar_url(String avatar_url) {
                this.avatar_url = avatar_url;
            }

            public String getUser_id() {
                return user_id;
            }

            public void setUser_id(String user_id) {
                this.user_id = user_id;
            }

            public int getIs_verify() {
                return is_verify;
            }

            public void setIs_verify(int is_verify) {
                this.is_verify = is_verify;
            }

            public String getUser_intro() {
                return user_intro;
            }

            public void setUser_intro(String user_intro) {
                this.user_intro = user_intro;
            }

            public int getIs_following() {
                return is_following;
            }

            public void setIs_following(int is_following) {
                this.is_following = is_following;
            }

            public String getUser_auth_info() {
                return user_auth_info;
            }

            public void setUser_auth_info(String user_auth_info) {
                this.user_auth_info = user_auth_info;
            }

            public String getDesc_icon_url() {
                return desc_icon_url;
            }

            public void setDesc_icon_url(String desc_icon_url) {
                this.desc_icon_url = desc_icon_url;
            }
        }

        public static class ShareDataBean {
            /**
             * content : 本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。
             * image_url : http://p9-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05
             * share_url : https://m.zjurl.cn/question/6855150375201390856/?app=news_article&app_id=0
             * title : 女生突然弯了是什么体验？(236个回答) - 悟空问答
             */

            private String content;
            private String image_url;
            private String share_url;
            private String title;

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }

            public String getImage_url() {
                return image_url;
            }

            public void setImage_url(String image_url) {
                this.image_url = image_url;
            }

            public String getShare_url() {
                return share_url;
            }

            public void setShare_url(String share_url) {
                this.share_url = share_url;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }

        public static class ContentBean {
            /**
             * text : 本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。
             * thumb_image_list : []
             * large_image_list : []
             * origin_image_list : null
             * rich_text : 本人女，之前谈的对象也都是男生，出去旅游，发现自己喜欢上了一个女生，是那种心动的感觉，想到她会不由自主的笑，感觉幸福，同时也感觉有点慌，不知该如何是好。
             * content_rich_span : {"links":[]}
             */

            private String text;
            private Object origin_image_list;
            private String rich_text;
            private String content_rich_span;
            private List<?> thumb_image_list;
            private List<?> large_image_list;

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public Object getOrigin_image_list() {
                return origin_image_list;
            }

            public void setOrigin_image_list(Object origin_image_list) {
                this.origin_image_list = origin_image_list;
            }

            public String getRich_text() {
                return rich_text;
            }

            public void setRich_text(String rich_text) {
                this.rich_text = rich_text;
            }

            public String getContent_rich_span() {
                return content_rich_span;
            }

            public void setContent_rich_span(String content_rich_span) {
                this.content_rich_span = content_rich_span;
            }

            public List<?> getThumb_image_list() {
                return thumb_image_list;
            }

            public void setThumb_image_list(List<?> thumb_image_list) {
                this.thumb_image_list = thumb_image_list;
            }

            public List<?> getLarge_image_list() {
                return large_image_list;
            }

            public void setLarge_image_list(List<?> large_image_list) {
                this.large_image_list = large_image_list;
            }
        }

        public static class FoldReasonBean {
            /**
             * open_url : sslocal://detail?groupid=6293724675596402946
             * title : 为什么折叠?
             */

            private String open_url;
            private String title;

            public String getOpen_url() {
                return open_url;
            }

            public void setOpen_url(String open_url) {
                this.open_url = open_url;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }

        public static class ShareInfoBean {
            /**
             * share_type : {"pyq":0,"qq":0,"qzone":0,"wx":0}
             * token_type : 1
             * share_url : https://m.zjurl.cn/question/6855150375201390856/?app=news_article&app_id=0
             * title : 女生突然弯了是什么体验？(236个回答) - 悟空问答
             */

            private ShareTypeBean share_type;
            private int token_type;
            private String share_url;
            private String title;

            public ShareTypeBean getShare_type() {
                return share_type;
            }

            public void setShare_type(ShareTypeBean share_type) {
                this.share_type = share_type;
            }

            public int getToken_type() {
                return token_type;
            }

            public void setToken_type(int token_type) {
                this.token_type = token_type;
            }

            public String getShare_url() {
                return share_url;
            }

            public void setShare_url(String share_url) {
                this.share_url = share_url;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public static class ShareTypeBean {
                /**
                 * pyq : 0
                 * qq : 0
                 * qzone : 0
                 * wx : 0
                 */

                private int pyq;
                private int qq;
                private int qzone;
                private int wx;

                public int getPyq() {
                    return pyq;
                }

                public void setPyq(int pyq) {
                    this.pyq = pyq;
                }

                public int getQq() {
                    return qq;
                }

                public void setQq(int qq) {
                    this.qq = qq;
                }

                public int getQzone() {
                    return qzone;
                }

                public void setQzone(int qzone) {
                    this.qzone = qzone;
                }

                public int getWx() {
                    return wx;
                }

                public void setWx(int wx) {
                    this.wx = wx;
                }
            }
        }

        public static class TipsBean {
            /**
             * tips_type : 0
             * tips_text :
             * tips_schema :
             * tips_button_text :
             */

            private int tips_type;
            private String tips_text;
            private String tips_schema;
            private String tips_button_text;

            public int getTips_type() {
                return tips_type;
            }

            public void setTips_type(int tips_type) {
                this.tips_type = tips_type;
            }

            public String getTips_text() {
                return tips_text;
            }

            public void setTips_text(String tips_text) {
                this.tips_text = tips_text;
            }

            public String getTips_schema() {
                return tips_schema;
            }

            public void setTips_schema(String tips_schema) {
                this.tips_schema = tips_schema;
            }

            public String getTips_button_text() {
                return tips_button_text;
            }

            public void setTips_button_text(String tips_button_text) {
                this.tips_button_text = tips_button_text;
            }
        }

        public static class CountStatisticsBean {
            /**
             * count_name : 收藏量
             * count_num : 350
             * count_type : 1
             */

            private String count_name;
            private String count_num;
            private int count_type;

            public String getCount_name() {
                return count_name;
            }

            public void setCount_name(String count_name) {
                this.count_name = count_name;
            }

            public String getCount_num() {
                return count_num;
            }

            public void setCount_num(String count_num) {
                this.count_num = count_num;
            }

            public int getCount_type() {
                return count_type;
            }

            public void setCount_type(int count_type) {
                this.count_type = count_type;
            }
        }
    }

    public static class RepostParamsBean {
        /**
         * repost_type : 218
         * fw_id : 6855150375201390856
         * fw_id_type : 1026
         * fw_user_id : 3708573337
         * opt_id : 6855150375201390856
         * opt_id_type : 1026
         * schema :
         * title : 女生突然弯了是什么体验？
         * cover_url : http://p9-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05
         */

        private int repost_type;
        private long fw_id;
        private int fw_id_type;
        private long fw_user_id;
        private long opt_id;
        private int opt_id_type;
        private String schema;
        private String title;
        private String cover_url;

        public int getRepost_type() {
            return repost_type;
        }

        public void setRepost_type(int repost_type) {
            this.repost_type = repost_type;
        }

        public long getFw_id() {
            return fw_id;
        }

        public void setFw_id(long fw_id) {
            this.fw_id = fw_id;
        }

        public int getFw_id_type() {
            return fw_id_type;
        }

        public void setFw_id_type(int fw_id_type) {
            this.fw_id_type = fw_id_type;
        }

        public long getFw_user_id() {
            return fw_user_id;
        }

        public void setFw_user_id(long fw_user_id) {
            this.fw_user_id = fw_user_id;
        }

        public long getOpt_id() {
            return opt_id;
        }

        public void setOpt_id(long opt_id) {
            this.opt_id = opt_id;
        }

        public int getOpt_id_type() {
            return opt_id_type;
        }

        public void setOpt_id_type(int opt_id_type) {
            this.opt_id_type = opt_id_type;
        }

        public String getSchema() {
            return schema;
        }

        public void setSchema(String schema) {
            this.schema = schema;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getCover_url() {
            return cover_url;
        }

        public void setCover_url(String cover_url) {
            this.cover_url = cover_url;
        }
    }

    public static class AnsListBean {
        /**
         * ansid : 6857399014657605888
         * forward_count : 3
         * comment_count : 59
         * digg_count : 4153
         * brow_count : 3917812
         * bury_count : 80
         * is_digg : false
         * is_show_bury : true
         * is_buryed : false
         * title :
         * schema : sslocal://wenda_detail?ansid=6857399014657605888&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A0%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226857399014657605888%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%224472293773%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&video_type=0
         * comment_schema : sslocal://wenda_detail?ansid=6857399014657605888&answer_type=0&api_param=%7B%22answer_list%22%3A%5B6857399014657605888%2C6881631043347906823%2C6881756795401699599%2C6883417412856398080%2C6857042236359475467%2C6894760666511851791%2C6878993731777855758%2C6884960336010264847%2C6881406478847754499%2C6895704779616862471%5D%2C%22answer_type%22%3A%22nice_answer%22%2C%22enter_ansid%22%3A%22%22%2C%22in_offset%22%3A0%2C%22next_offset%22%3A10%7D&gd_ext_json=%7B%22enter_from%22%3A%22click_answer%22%2C%22ansid%22%3A%226857399014657605888%22%2C%22enterfrom_answerid%22%3A%22%22%2C%22parent_enterfrom%22%3A%22%22%2C%22qid%22%3A%22%22%2C%22category_name%22%3A%22%22%2C%22author_id%22%3A%224472293773%22%2C%22article_type%22%3A%22wenda%22%2C%22log_pb%22%3Anull%2C%22origin_source%22%3A%22%22%2C%22from_gid%22%3A%22%22%7D&is_jump_comment=1&video_type=0
         * create_time : 1596612767
         * ans_url : https://ic.snssdk.com/wenda/v1/wapanswer/content/?ansid=6857399014657605888
         * user : {"uname":"园娘娘有点野","avatar_url":"https://p1-dy.bytexservice.com/img/user-avatar/073069f529d89c28ae2fa0b77be09bd2~300x300.image","user_id":"4472293773","is_verify":0,"create_time":1433338089,"user_intro":"","is_following":0,"user_auth_info":"","schema":"sslocal://profile?refer=wenda&uid=4472293773","total_digg":13149,"total_answer":192,"desc_icon_url":""}
         * share_data : {"content":"看热点讨论，问明星专家，上悟空头条","image_url":"http://p6-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05","share_url":"https://m.zjurl.cn/answer/6857399014657605888/?app=news_article&app_id=0","title":"女生突然弯了是什么体验？(园娘娘有点野的回答)- 悟空问答"}
         * content_abstract : {"text":"我读高中的时候，身边有两个玩的很好的女同学。高一的时侯都还喜欢男生啊。突然高二的时候因为同时喜欢一个女生翻脸了。她们两同时喜欢的那个女生个子170以上，皮肤白白的，很瘦，长得比大多数男生还帅气。当时在我们附近几所高中之间的弯弯群还挺有名气，听说好多女生都喜欢她。后来我这两个女同学的其中一个和他谈了一段时间恋爱。大概小半年。他们在一起也有亲密动作......和她们聊起女生弯了是什么感觉，大概就是看到她有像见到喜欢的人一样的心动感，想每天都她在一起，手牵手和做任何亲密的动作也毫无违和感。谈恋爱和正常异性之间没有区别。最后，这两个女生里的其中一个上大学后就恢复正常了，现在都是两个孩子的妈了。而另一个女生已无法回头，一直弯下去了。现在仍然和女人生活在一起。我们这群同学都知道，但是也没人笑话她，都尊重她个人的性取向。同学聚会呀、朋友圈呀这些她也从来不避嫌，还会带上她现在的\u201c男朋友\u201d，也经常发两个人的亲密自拍照。因为有过接触同性恋的经历，所以后来也很自然的接受了同性恋人成为我的朋友。其中有一对事业爱情都发展的很好，两个人白手起家通过10年的努力有了自己的公司，大概几千万资产，依然相亲相爱感情很好。让我看到了爱情的样子。最后总结一下：女同性恋，又称拉拉、蕾丝边、Lesbian、Les、 Girlslove，是指只对同性产生爱情和性欲的女性。很多女同性恋都是在青春期后才开始发现原来自己喜欢同性，就像我的同学那样。她们更注重女权的平等，相互支持与依偎取暖。也需要得到我们更多的认可与平常心态。女生突然弯了，可能，是世界给你敞开了另一扇情感的大门。一样心动，一样恋爱，一样幸福。","thumb_image_list":[],"large_image_list":[],"origin_image_list":null,"wenda_cv_image_list":null,"video_list":[]}
         * user_repin : false
         * log_pb :
         * is_origin_pair_ans : false
         * show_text :
         * show_count : 0
         * display_count : 0
         * read_count : 0
         * category_name :
         * enter_from :
         * answer_detail : null
         * enable_prefetch : false
         * enable_prefetch_cdn : false
         * answer_detail_cdn :
         */

        private String ansid;
        private int forward_count;
        private int comment_count;
        private int digg_count;
        private int brow_count;
        private int bury_count;
        private boolean is_digg;
        private boolean is_show_bury;
        private boolean is_buryed;
        private String title;
        private String schema;
        private String comment_schema;
        private int create_time;
        private String ans_url;
        private UserBeanX user;
        private ShareDataBeanX share_data;
        private ContentAbstractBean content_abstract;
        private boolean user_repin;
        private String log_pb;
        private boolean is_origin_pair_ans;
        private String show_text;
        private int show_count;
        private int display_count;
        private int read_count;
        private String category_name;
        private String enter_from;
        private Object answer_detail;
        private boolean enable_prefetch;
        private boolean enable_prefetch_cdn;
        private String answer_detail_cdn;

        public String getAnsid() {
            return ansid;
        }

        public void setAnsid(String ansid) {
            this.ansid = ansid;
        }

        public int getForward_count() {
            return forward_count;
        }

        public void setForward_count(int forward_count) {
            this.forward_count = forward_count;
        }

        public int getComment_count() {
            return comment_count;
        }

        public void setComment_count(int comment_count) {
            this.comment_count = comment_count;
        }

        public int getDigg_count() {
            return digg_count;
        }

        public void setDigg_count(int digg_count) {
            this.digg_count = digg_count;
        }

        public int getBrow_count() {
            return brow_count;
        }

        public void setBrow_count(int brow_count) {
            this.brow_count = brow_count;
        }

        public int getBury_count() {
            return bury_count;
        }

        public void setBury_count(int bury_count) {
            this.bury_count = bury_count;
        }

        public boolean isIs_digg() {
            return is_digg;
        }

        public void setIs_digg(boolean is_digg) {
            this.is_digg = is_digg;
        }

        public boolean isIs_show_bury() {
            return is_show_bury;
        }

        public void setIs_show_bury(boolean is_show_bury) {
            this.is_show_bury = is_show_bury;
        }

        public boolean isIs_buryed() {
            return is_buryed;
        }

        public void setIs_buryed(boolean is_buryed) {
            this.is_buryed = is_buryed;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getSchema() {
            return schema;
        }

        public void setSchema(String schema) {
            this.schema = schema;
        }

        public String getComment_schema() {
            return comment_schema;
        }

        public void setComment_schema(String comment_schema) {
            this.comment_schema = comment_schema;
        }

        public int getCreate_time() {
            return create_time;
        }

        public void setCreate_time(int create_time) {
            this.create_time = create_time;
        }

        public String getAns_url() {
            return ans_url;
        }

        public void setAns_url(String ans_url) {
            this.ans_url = ans_url;
        }

        public UserBeanX getUser() {
            return user;
        }

        public void setUser(UserBeanX user) {
            this.user = user;
        }

        public ShareDataBeanX getShare_data() {
            return share_data;
        }

        public void setShare_data(ShareDataBeanX share_data) {
            this.share_data = share_data;
        }

        public ContentAbstractBean getContent_abstract() {
            return content_abstract;
        }

        public void setContent_abstract(ContentAbstractBean content_abstract) {
            this.content_abstract = content_abstract;
        }

        public boolean isUser_repin() {
            return user_repin;
        }

        public void setUser_repin(boolean user_repin) {
            this.user_repin = user_repin;
        }

        public String getLog_pb() {
            return log_pb;
        }

        public void setLog_pb(String log_pb) {
            this.log_pb = log_pb;
        }

        public boolean isIs_origin_pair_ans() {
            return is_origin_pair_ans;
        }

        public void setIs_origin_pair_ans(boolean is_origin_pair_ans) {
            this.is_origin_pair_ans = is_origin_pair_ans;
        }

        public String getShow_text() {
            return show_text;
        }

        public void setShow_text(String show_text) {
            this.show_text = show_text;
        }

        public int getShow_count() {
            return show_count;
        }

        public void setShow_count(int show_count) {
            this.show_count = show_count;
        }

        public int getDisplay_count() {
            return display_count;
        }

        public void setDisplay_count(int display_count) {
            this.display_count = display_count;
        }

        public int getRead_count() {
            return read_count;
        }

        public void setRead_count(int read_count) {
            this.read_count = read_count;
        }

        public String getCategory_name() {
            return category_name;
        }

        public void setCategory_name(String category_name) {
            this.category_name = category_name;
        }

        public String getEnter_from() {
            return enter_from;
        }

        public void setEnter_from(String enter_from) {
            this.enter_from = enter_from;
        }

        public Object getAnswer_detail() {
            return answer_detail;
        }

        public void setAnswer_detail(Object answer_detail) {
            this.answer_detail = answer_detail;
        }

        public boolean isEnable_prefetch() {
            return enable_prefetch;
        }

        public void setEnable_prefetch(boolean enable_prefetch) {
            this.enable_prefetch = enable_prefetch;
        }

        public boolean isEnable_prefetch_cdn() {
            return enable_prefetch_cdn;
        }

        public void setEnable_prefetch_cdn(boolean enable_prefetch_cdn) {
            this.enable_prefetch_cdn = enable_prefetch_cdn;
        }

        public String getAnswer_detail_cdn() {
            return answer_detail_cdn;
        }

        public void setAnswer_detail_cdn(String answer_detail_cdn) {
            this.answer_detail_cdn = answer_detail_cdn;
        }

        public static class UserBeanX {
            /**
             * uname : 园娘娘有点野
             * avatar_url : https://p1-dy.bytexservice.com/img/user-avatar/073069f529d89c28ae2fa0b77be09bd2~300x300.image
             * user_id : 4472293773
             * is_verify : 0
             * create_time : 1433338089
             * user_intro :
             * is_following : 0
             * user_auth_info :
             * schema : sslocal://profile?refer=wenda&uid=4472293773
             * total_digg : 13149
             * total_answer : 192
             * desc_icon_url :
             */

            private String uname;
            private String avatar_url;
            private String user_id;
            private int is_verify;
            private int create_time;
            private String user_intro;
            private int is_following;
            private String user_auth_info;
            private String schema;
            private int total_digg;
            private int total_answer;
            private String desc_icon_url;

            public String getUname() {
                return uname;
            }

            public void setUname(String uname) {
                this.uname = uname;
            }

            public String getAvatar_url() {
                return avatar_url;
            }

            public void setAvatar_url(String avatar_url) {
                this.avatar_url = avatar_url;
            }

            public String getUser_id() {
                return user_id;
            }

            public void setUser_id(String user_id) {
                this.user_id = user_id;
            }

            public int getIs_verify() {
                return is_verify;
            }

            public void setIs_verify(int is_verify) {
                this.is_verify = is_verify;
            }

            public int getCreate_time() {
                return create_time;
            }

            public void setCreate_time(int create_time) {
                this.create_time = create_time;
            }

            public String getUser_intro() {
                return user_intro;
            }

            public void setUser_intro(String user_intro) {
                this.user_intro = user_intro;
            }

            public int getIs_following() {
                return is_following;
            }

            public void setIs_following(int is_following) {
                this.is_following = is_following;
            }

            public String getUser_auth_info() {
                return user_auth_info;
            }

            public void setUser_auth_info(String user_auth_info) {
                this.user_auth_info = user_auth_info;
            }

            public String getSchema() {
                return schema;
            }

            public void setSchema(String schema) {
                this.schema = schema;
            }

            public int getTotal_digg() {
                return total_digg;
            }

            public void setTotal_digg(int total_digg) {
                this.total_digg = total_digg;
            }

            public int getTotal_answer() {
                return total_answer;
            }

            public void setTotal_answer(int total_answer) {
                this.total_answer = total_answer;
            }

            public String getDesc_icon_url() {
                return desc_icon_url;
            }

            public void setDesc_icon_url(String desc_icon_url) {
                this.desc_icon_url = desc_icon_url;
            }
        }

        public static class ShareDataBeanX {
            /**
             * content : 看热点讨论，问明星专家，上悟空头条
             * image_url : http://p6-tt-ipv6.byteimg.com/origin/18a300102cab5d8d0e05
             * share_url : https://m.zjurl.cn/answer/6857399014657605888/?app=news_article&app_id=0
             * title : 女生突然弯了是什么体验？(园娘娘有点野的回答)- 悟空问答
             */

            private String content;
            private String image_url;
            private String share_url;
            private String title;

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }

            public String getImage_url() {
                return image_url;
            }

            public void setImage_url(String image_url) {
                this.image_url = image_url;
            }

            public String getShare_url() {
                return share_url;
            }

            public void setShare_url(String share_url) {
                this.share_url = share_url;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }

        public static class ContentAbstractBean {
            /**
             * text : 我读高中的时候，身边有两个玩的很好的女同学。高一的时侯都还喜欢男生啊。突然高二的时候因为同时喜欢一个女生翻脸了。她们两同时喜欢的那个女生个子170以上，皮肤白白的，很瘦，长得比大多数男生还帅气。当时在我们附近几所高中之间的弯弯群还挺有名气，听说好多女生都喜欢她。后来我这两个女同学的其中一个和他谈了一段时间恋爱。大概小半年。他们在一起也有亲密动作......和她们聊起女生弯了是什么感觉，大概就是看到她有像见到喜欢的人一样的心动感，想每天都她在一起，手牵手和做任何亲密的动作也毫无违和感。谈恋爱和正常异性之间没有区别。最后，这两个女生里的其中一个上大学后就恢复正常了，现在都是两个孩子的妈了。而另一个女生已无法回头，一直弯下去了。现在仍然和女人生活在一起。我们这群同学都知道，但是也没人笑话她，都尊重她个人的性取向。同学聚会呀、朋友圈呀这些她也从来不避嫌，还会带上她现在的“男朋友”，也经常发两个人的亲密自拍照。因为有过接触同性恋的经历，所以后来也很自然的接受了同性恋人成为我的朋友。其中有一对事业爱情都发展的很好，两个人白手起家通过10年的努力有了自己的公司，大概几千万资产，依然相亲相爱感情很好。让我看到了爱情的样子。最后总结一下：女同性恋，又称拉拉、蕾丝边、Lesbian、Les、 Girlslove，是指只对同性产生爱情和性欲的女性。很多女同性恋都是在青春期后才开始发现原来自己喜欢同性，就像我的同学那样。她们更注重女权的平等，相互支持与依偎取暖。也需要得到我们更多的认可与平常心态。女生突然弯了，可能，是世界给你敞开了另一扇情感的大门。一样心动，一样恋爱，一样幸福。
             * thumb_image_list : []
             * large_image_list : []
             * origin_image_list : null
             * wenda_cv_image_list : null
             * video_list : []
             */

            private String text;
            private Object origin_image_list;
            private Object wenda_cv_image_list;
            private List<?> thumb_image_list;
            private List<?> large_image_list;
            private List<?> video_list;

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public Object getOrigin_image_list() {
                return origin_image_list;
            }

            public void setOrigin_image_list(Object origin_image_list) {
                this.origin_image_list = origin_image_list;
            }

            public Object getWenda_cv_image_list() {
                return wenda_cv_image_list;
            }

            public void setWenda_cv_image_list(Object wenda_cv_image_list) {
                this.wenda_cv_image_list = wenda_cv_image_list;
            }

            public List<?> getThumb_image_list() {
                return thumb_image_list;
            }

            public void setThumb_image_list(List<?> thumb_image_list) {
                this.thumb_image_list = thumb_image_list;
            }

            public List<?> getLarge_image_list() {
                return large_image_list;
            }

            public void setLarge_image_list(List<?> large_image_list) {
                this.large_image_list = large_image_list;
            }

            public List<?> getVideo_list() {
                return video_list;
            }

            public void setVideo_list(List<?> video_list) {
                this.video_list = video_list;
            }
        }
    }

    public static class ModuleListBean {
        /**
         * day_icon_url : http://p26-tt.byteimg.com/origin/1bf50001abbc1c7f8dba
         * night_icon_url : http://p9-tt-ipv6.byteimg.com/origin/1bf40001abebc0717135
         * text : 更多问答
         * schema : sslocal://feed?api_param=%7B%22enter_from%22%3A%22%22%2C%22origin_from%22%3A%22%22%2C%22source%22%3A%22question_brow%22%7D&category=question_and_answer&concern_id=6260258266329123329&name=%E5%9B%9E%E7%AD%94&type=4
         * icon_type : 2
         */

        private String day_icon_url;
        private String night_icon_url;
        private String text;
        private String schema;
        private int icon_type;

        public String getDay_icon_url() {
            return day_icon_url;
        }

        public void setDay_icon_url(String day_icon_url) {
            this.day_icon_url = day_icon_url;
        }

        public String getNight_icon_url() {
            return night_icon_url;
        }

        public void setNight_icon_url(String night_icon_url) {
            this.night_icon_url = night_icon_url;
        }

        public String getText() {
            return text;
        }

        public void setText(String text) {
            this.text = text;
        }

        public String getSchema() {
            return schema;
        }

        public void setSchema(String schema) {
            this.schema = schema;
        }

        public int getIcon_type() {
            return icon_type;
        }

        public void setIcon_type(int icon_type) {
            this.icon_type = icon_type;
        }
    }
}
